app/controllers/favorite_movies_controller.rb

  def index
    @favorite_movies = FavoriteMovie.all
---
SELECT "favorite_movies".* FROM "favorite_movies"

  def create
    @favorite_movie = FavoriteMovie.new(favorite_movie_params)

    respond_to do |format|
      if @favorite_movie.save
---
INSERT INTO "favorite_movies" ("title", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Teste de Filme 1"], ["date", "2021-08-19"], ["created_at", "2021-08-19 19:45:15.642780"], ["updated_at", "2021-08-19 19:45:15.642780"]]

  def destroy
    @favorite_movie.destroy
---
DELETE FROM "favorite_movies" WHERE "favorite_movies"."id" = ?  [["id", 40]]

    def set_favorite_movie
      @favorite_movie = FavoriteMovie.find(params[:id])
---
SELECT "favorite_movies".* FROM "favorite_movies" WHERE "favorite_movies"."id" = ? LIMIT ?  [["id", 40], ["LIMIT", 1]]