app/controllers/movies_controller.rb

    def index
        @movies = getMovies
        @favorite_movies = FavoriteMovie.all
---
SELECT "favorite_movies".* FROM "favorite_movies" ORDER BY "favorite_movies"."id" ASC LIMIT ?  [["LIMIT", 1]]

    def insertFavoriteMovie
        @favorite_movie = FavoriteMovie.new(title: params[:Title], date: params[:Year])
        @favorite_movie.save
---
INSERT INTO "favorite_movies" ("title", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Batman: The Dark Knight Returns, Part 1"], ["date", "2012"], ["created_at", "2021-08-20 01:25:11.571732"], ["updated_at", "2021-08-20 01:25:11.571732"]]